#ifndef _ICE_PUB_H
#define _ICE_PUB_H
#include "IceBaseType.h"
/******************************************************************************\
*									引入函数
/******************************************************************************/


/******************************************************************************\
*									引入变量
/******************************************************************************/
extern V_WND_PARENT_CHILD_V g_v_wnd_parent_childv;
extern WND_VECTOR g_vWnd;
extern V_HANDLE g_vProcess;
/******************************************************************************\
*									基本函数声明
/******************************************************************************/
/* str1 是否与 str2 匹配 */
BOOL IcyStringMatch(const char* str1, const char* str2);

/* ============================================================================
 * 刷新全局变量g_v_wnd_parent_childv，g_vWnd */
void IcyRefreshWindowHandles();

void TestIcyRefreshWindowHandles();
//=============================================================================

/* 字节序转换 */
int CvrtOrder(const char *p,  unsigned char len);

#endif